In [1]:
import codecs
import requests
import json
import pandas as pd
import numpy as np

import sys
default_encoding = 'utf-8'
if sys.getdefaultencoding() != default_encoding:
    reload(sys)
    sys.setdefaultencoding(default_encoding)

In [2]:

r=requests.get("http://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data")
f=codecs.open('c:\\pythonCoding\\S1EP3_Iris.txt','w',encoding='utf-8')
f.write(r.text)

In [3]:
import pandas as pd
'''
pd.read_csv:header=None,不然会把数据的第一行作为列索引，缺失一行数据
header表示数据中是否存在列名，不存在就写None
encoding 表示数据集的字符编码，通常一份数据为了方便的进行文件传输都以utf-8作为标准
'''
RequestData=pd.read_csv('c:\\pythonCoding\\S1EP3_Iris.txt',header=None,encoding='utf-8');
#RequestData

In [4]:
RequestData.columns=['sepal_length','sepal_width','petal_length','petal_width','class'];
#RequestData

In [5]:
RequestData['class'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
dtype: int64

In [6]:
Series_Dict={'American':'NY',"France":"Pairs","China":"BeiJing"}

In [7]:
SeriesData=pd.Series(Series_Dict)
SeriesData

American         NY
China       BeiJing
France        Pairs
dtype: object

In [8]:
 SeriesData.values

array(['NY', 'BeiJing', 'Pairs'], dtype=object)

In [9]:
SeriesData1=pd.Series(SeriesData,index=["china","American","France","England"])

In [10]:
'''
series的复合索引
'''
mutil=pd.Index([("Row"+str(x),"Col"+str(y)) for x in xrange(4) for y in xrange(4)])
data1=pd.Series(xrange(0,16),index=mutil)
data1

Row0  Col0     0
      Col1     1
      Col2     2
      Col3     3
Row1  Col0     4
      Col1     5
      Col2     6
      Col3     7
Row2  Col0     8
      Col1     9
      Col2    10
      Col3    11
Row3  Col0    12
      Col1    13
      Col2    14
      Col3    15
dtype: int32

In [11]:
'''
MultiIndex的Series可以unstack()成DataFrame
DataFrame可以stack成拥有双重MultiIndex的Series
'''
data1.unstack()

      Col0  Col1  Col2  Col3
Row0     0     1     2     3
Row1     4     5     6     7
Row2     8     9    10    11
Row3    12    13    14    15

In [13]:
import json
json_data=[{'name':'wang','sal':50000,'job':'VP'},{'name':'zhang','job':'Manager','report':'VP'},{'name':'Lee','sal':5000,'report':'IT'}]
data_employee=pd.read_json(json.dumps(json_data))
data_employee

       job   name report    sal
0       VP   wang    NaN  50000
1  Manager  zhang     VP    NaN
2      NaN    Lee     IT   5000

In [14]:
data_employee.reindex(columns=['name','job','sal','report'])

    name      job    sal report
0   wang       VP  50000    NaN
1  zhang  Manager    NaN     VP
2    Lee      NaN   5000     IT

In [15]:
data_employee1=data_employee.reindex(columns=['name','job','sal','report'])
data_employeeSum=pd.concat([data_employee1,data_employee1])
data_employeeSum

    name      job    sal report
0   wang       VP  50000    NaN
1  zhang  Manager    NaN     VP
2    Lee      NaN   5000     IT
0   wang       VP  50000    NaN
1  zhang  Manager    NaN     VP
2    Lee      NaN   5000     IT

In [16]:
pd.merge(data_employee1,data_employee1,on='name')

    name    job_x  sal_x report_x    job_y  sal_y report_y
0   wang       VP  50000      NaN       VP  50000      NaN
1  zhang  Manager    NaN       VP  Manager    NaN       VP
2    Lee      NaN   5000       IT      NaN   5000       IT

#数据的合并，整理
横向连接---concat
数据块A B C
concat连接：========》A
                      B
                      C(ABC排成一列)

纵向连接---merge
数据块A B C
merge连接：========》ABC

In [7]:
#单条数据的合并
#---------------------------------------------------------
r1=np.random.rand(3)
r2=np.random.rand(4)
r3=np.random.rand(2)

df=pd.DataFrame([r1,r2,r3],columns=['c1','c2','c3','c4'])
print r1
print r2
print r3
print df

[ 0.29466354  0.53271311  0.95729857]
[ 0.24678673  0.07176952  0.44165165  0.4210018 ]
[ 0.26032399  0.76351393]
         c1        c2        c3        c4
0  0.294664  0.532713  0.957299       NaN
1  0.246787  0.071770  0.441652  0.421002
2  0.260324  0.763514       NaN       NaN

In [8]:
#一块一块数据的横向连接 concat
json_data=[{'name':'wang','sal':50000,'job':'VP'},{'name':'zhang','job':'Manager','report':'VP'},{'name':'Lee','sal':5000,'report':'IT'}]
data_employee=pd.read_json(json.dumps(json_data))
data_employee1=data_employee.reindex(columns=['name','job','sal','report'])
data_employeeSum=pd.concat([data_employee1,data_employee1])#《============在这里使用concat函数，实现横向连接
data_employeeSum

    name      job    sal report
0   wang       VP  50000    NaN
1  zhang  Manager    NaN     VP
2    Lee      NaN   5000     IT
0   wang       VP  50000    NaN
1  zhang  Manager    NaN     VP
2    Lee      NaN   5000     IT

In [9]:
#注意在上面的连接中，index同样被复制连接了，如果要忽略，需使用参数ignore_index
pd.concat([data_employee1,data_employee1],ignore_index=True)

    name      job    sal report
0   wang       VP  50000    NaN
1  zhang  Manager    NaN     VP
2    Lee      NaN   5000     IT
3   wang       VP  50000    NaN
4  zhang  Manager    NaN     VP
5    Lee      NaN   5000     IT

In [13]:
#纵向连接merge
pd.merge(data_employee1,data_employee1,on="name")#on参数指明按照哪个列名连接

    name    job_x  sal_x report_x    job_y  sal_y report_y
0   wang       VP  50000      NaN       VP  50000      NaN
1  zhang  Manager    NaN       VP  Manager    NaN       VP
2    Lee      NaN   5000       IT      NaN   5000       IT

In [14]:
pd.merge(data_employee1,data_employee1,on=["name","job"])#该种情况主要是在同一列名下，有相同名字时，可以使用

    name      job  sal_x report_x  sal_y report_y
0   wang       VP  50000      NaN  50000      NaN
1  zhang  Manager    NaN       VP    NaN       VP
2    Lee      NaN   5000       IT   5000       IT

In [17]:
#merge 按照index关联时，DataFrame必须有index名
data_employee1.index.name="index1"
pd.merge(data_employee1,data_employee1,left_index="index1",right_index="index1")

       name_x    job_x  sal_x report_x name_y    job_y  sal_y report_y
index1
0        wang       VP  50000      NaN   wang       VP  50000      NaN
1       zhang  Manager    NaN       VP  zhang  Manager    NaN       VP
2         Lee      NaN   5000       IT    Lee      NaN   5000       IT

In [23]:
df1=pd.DataFrame({'name':[u'老王',u'老李',u'老刘'],"salary":[1000,25000,20000]})
df2=pd.DataFrame({'name':[u'老王',u'老李'],"job":["guard","VP"]})
pd.merge(df1,df2,how="left") #how="left"按照左表即df1，合并
pd.merge(df1,df2,how="right") # how="right"按照左表即df2，合并  
#how="inner"按交集合并，how="outer"按并集合并

  name  salary    job
0   老王    1000  guard
1   老李   25000     VP

#数据清洗的三剑客，map，applymap，apply

### 将一个自定义的函数应用到Pandas的数据结构中可以使用map(), apply()或者applymap()，它们的区别在于应用的对象不同。

1. map() 是一个Series的函数，DataFrame结构中没有map()。map()将一个自定义函数应用于Series结构中的每个元素(elements)。

2. apply()和applymap()是DataFrame结构中的函数，Series中没有。它们的区别在于，apply()将一个函数作用于DataFrame中的每个行或者列（axis=0对列操作，默认情况下。axis=1对行操作），而applymap()是将函数做用于DataFrame中的所有元素(elements)。​

In [27]:
npdata=np.asarray([("china","beijing",8000),("s.korea","sesol",2000),("enland","landon",5000)])
df3=pd.DataFrame(npdata,columns=["nations","captial","GDP"])
df3

   nations  captial   GDP
0    china  beijing  8000
1  s.korea    sesol  2000
2   enland   landon  5000

In [33]:
def GDP_factorize(a):
    temp=np.float64(a)
    if temp>5000.0:
        return "high"
    elif temp<3000.0:
        return "low"
    else:
        return "medium"

df3['rank']=df3['GDP'].map(GDP_factorize)#map中既可以是自建函数也可以是Python的内置函数
df3

   nations  captial   GDP    rank
0    china  beijing  8000    high
1  s.korea    sesol  2000     low
2   enland   landon  5000  medium

In [34]:
# applymap相当于是与DataFrame中的每一个元素都进行函数运算
df3.applymap(lambda x: float(x)*2 if x.isdigit() else x.upper())

   nations  captial    GDP    rank
0    CHINA  BEIJING  16000    HIGH
1  S.KOREA    SESOL   4000     LOW
2   ENLAND   LANDON  10000  MEDIUM

In [ ]:
#apply可以对DataFrame操作，而得到一个Series
df3.apply(lambda x: x['captial']+'_'+x['GDP'],axis=1)

#！！！！！！！！排序！！！！！！！！！！！！

In [42]:
df3.sort("GDP",ascending=False)#列名与ascending不要分开写，分开写相当于是排名了两次

   nations  captial   GDP    rank
0    china  beijing  8000    high
2   enland   landon  5000  medium
1  s.korea    sesol  2000     low

In [43]:
df3.sort("GDP").sort(ascending=False)

   nations  captial   GDP    rank
2   enland   landon  5000  medium
1  s.korea    sesol  2000     low
0    china  beijing  8000    high

In [45]:
df.sort_index(axis=1,ascending=True)  # axis=1对行进行排序,axis=0对列进行排序

         c1        c2        c3        c4
0  0.294664  0.532713  0.957299       NaN
1  0.246787  0.071770  0.441652  0.421002
2  0.260324  0.763514       NaN       NaN

In [11]:
df11 = pd.DataFrame(np.random.rand(3,4),index = [4,1,6],columns = list("adse"))
print df11
print df11.sort_index(axis = 1,ascending=True) #进行行升序排列
print df11.sort_values(by = ['a','s'])

AttributeError: 'DataFrame' object has no attribute 'sort_values'

## apply使用

In [7]:
df10 = pd.DataFrame(np.random.rand(4,3),index = ['jiangxi','beijing','shanghai','tianjing'],columns = list('abc'))
f = lambda x : x.max() - x.min()
print df10
#注意，默认axis=0，说明对列进行操作，axis=1对行进行操作
print "============"
print df10.apply(f)
print "============"
print df10.apply(f,axis = 1)